[
    {
        "subject": "Software engineering",
        "category": "collage",
        "notes": [
            {
                "heading": "Introduction to Software Engineering",
                "topic": "Software is a program or set of programs containing instructions that provide desired functionality. Engineering is the process of designing and building something that serves a particular purpose and finds a cost-effective solution to problems.",
                "title": "What is Software Engineering",
                "paragraph": [
                    {
                        "topic": "",
                        "para": [
                            "Software Engineering is the process of designing, developing, testing, and maintaining software. It is a systematic and disciplined approach to software development that aims to create high-quality, reliable, and maintainable software."
                        ]
                    },
                    {
                        "topic": "1.Software engineering",
                        "para": [
                            " includes a variety of techniques, tools, and methodologies, including requirements analysis, design, testing, and maintenance."
                        ]
                    },
                    {
                        "para": "2 . It is a rapidly evolving field and new tools and technologies are constantly being developed to improve the software development process."
                    },
                    {
                        "para": "3.By following the principles of software engineering and using the appropriate tools and methodologies, software developers can create high-quality, reliable, and maintainable software that meets the needs of its users."
                    },
                    {
                        "para": "4. Software Engineering is mainly used for large projects based on software systems rather than single programs or applications."
                    },
                    {
                        "para": "5.The main goal of Software Engineering is to develop software applications for improving quality,  budget, and time efficiency."
                    },
                    {
                        "para": "Software Engineering ensures that the software that has to be built should be consistent, correct, also on budget, on time, and within the required requirements."
                    }
                ]
            }
        ]
    }
]